# complex(real，[,imag]) 	创建一个复数
# repr(x) 	将 x 转换为表达式字符串
# eval(str) 	计算在字符串中的有效 Python 表达式，并返回一个对象
# chr(x) 	将整数 x 转换为一个字符
# ord(x) 	将一个字符 x 转换为它对应的整数值
# hex(x) 	将一个整数 x 转换为一个十六进制字符串
# oct(x) 	将一个整数 x 转换为一个八进制的字符串
# str( )：可以把其他类型数据转化为字符串类型
# int( )：可以把其他类型数据转化为整型
# float( )：可以把其他类型数据转化为浮点型
# bool( )：可以把其他类型数据转化为布尔类型
# list( )：可以把其他类型数据转化为列表类型
# tuple( )：可以把其他类型数据转化为元组类型
# dict( )：可以把其他类型数据转化为字典类型
# set( )：可以把其他类型数据转化为集合类型

# '<str>'.join(<list>)  list转换为str

# str转list
# <str>.strip('<str>') 方法用于移除字符串头尾指定的字符（默认为空格或换行符）或字符序列。该方法只能删除开头或是结尾的字符，不能删除中间部分的字符。
# <str>.split('<str>')方法用于通过指定分隔符对字符串进行切片，切片后生成列表。